Revit 2026 API

# AnalyticalSystemDomain Enumeration

---

The domain type of analytical system.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalSystemDomain
```
```vb
Public Enumeration AnalyticalSystemDomain
```
```cpp
public enum class AnalyticalSystemDomain
```
```fsharp
type AnalyticalSystemDomain
```

| Member name | Value | Description |
| --- | --- | --- |
| AirSystem | 1 |  |
| ElectricalSystem | 2 |  |
| WaterLoop | 0 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace